{
    "product_id": "70811758",
    "name": "Nokia 7.1 3/32GB Dual SIM Niebieski",
    "opinions": [
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Jestem zadowolona., , , Telefon kupiony w promocji za 799 złotych w sklepie x-kom.pl. Poza przeciętną baterią (Wykorzystanie przez ekran od ostatniego naładowania: 3-4 godz.), właściwie trudno się do czegokolwiek przyczepić w tym budżecie. Jest ładny, dobrze wykonany, sprawnie działa, regularnie otrzymuje aktualizacje bezpieczeństwa (zasługa Android One), szybki aparat i ładne zdjęcia., , , Jak to z telefonami ze szkła, jest śliski, dobrze jest go wsadzić w etui.",
            "author": "Mariola",
            "useful": 2,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10530363,
            "pros": "android one, dobrze wykończony, elegancki wygląd, estetyczny, funkcjonalność, google pay (nfc), łatwość obsługi, przyzwoite zdjęcia, wygląd, wystarczające osiągi",
            "cons": "czas pracy na baterii",
            "review_date": "2019-05-16 00:13:32",
            "purchase_date": "2019-04-26 00:51:58"
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "Mam sentyment do Nokii. Ten model jest jak najbardziej udany i bardzo dobrze wykonany. Dobry stosunek cena/ jakość. Jak na razie działa bez zarzutu. Jeśli chodzi o wady to tęsknię za przyciskiem spustu aparatu, obudowa jest bardzo śliska, bateria trochę krótko trzyma  no i oczywiście brak WP (ale na to już nie ma rady, jest obecnie przymus na androida i ios). Poza tym bardzo fajny telefon.",
            "author": "Łukasz",
            "useful": 2,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10548377,
            "pros": "android one, dobrze wykończony, elegancki wygląd, estetyczny, funkcjonalność, łatwość obsługi, nie za bogaty w funkcje aparat, przyzwoite zdjęcia, wygląd, wystarczające osiągi, za wysoka cena jak na parametry",
            "cons": "czas pracy na baterii, śliska obudowa",
            "review_date": "2019-05-20 15:22:37",
            "purchase_date": "2019-05-15 12:11:42"
        },
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Dobry telefon, bardzo estetyczny, zdjęcia na przyzwoitym poziomie. Minusem jest na przykład średniej jakości dźwięk z głośników",
            "author": "Użytkownik1665",
            "useful": 1,
            "useless": 0,
            "purchased": true,
            "opinion_id": 8872711,
            "pros": "czas pracy na baterii, estetyczny, funkcjonalność, łatwość obsługi, wygląd, wystarczające osiągi",
            "cons": "śliska obudowa",
            "review_date": "2019-01-06 11:55:45",
            "purchase_date": "2018-12-04 23:14:06"
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "zdecydowałem się na zakup bo trafiła się okazja nabycia telefonu w atrakcyjnej cenie i po miesiącu użytkowania mogę coś w końcu o nim powiedzieć:, , - wykończenie i jakość użytych materiałów na bardzo wysokim poziomie., , - bateria przy normalnym użytkowaniu (transmisja danych cały czas włączona, trochę przeglądania stron, trochę nawigacji, sporo smsów, trochę rozmów, trochę filmów, trochę muzyki, itp itd...) spokojnie starcza na 2 dni, przy oszczędniejszym używaniu nawet na 3., , - czytnik linii papilarnych działa bez zarzutu, tak samo jak sam telefon, nie zacina się, nie wiesza, działa płynnie, prosty w obsłudze, fajnie sprawuje się funkcja odblokowania twarzą, działa nawet przy kiepskim oświetleniu, przydatna przy etui z klapką., , - zdjęcia dobrej jakości, aczkolwiek sam program aparatu dość ubogi w funkcje, przydały by się jeszcze takie bajery jak zdjęcia 3D, zdjęcia 360 stopni, możliwość użycia filtrów takich jak np. zdjęcie czarno-białe, sepia, negatyw itd. (być może da się je nanieść po zrobieniu zdjęcia, nie sprawdzałem, ale osobiście wolałbym je mieć dostępne przed zrobieniem zdjęcia), przydałoby się też kilka programów tematycznych dla efektywniejszego wykorzystania aparatów, ponieważ tryb auto nie zawsze idealnie dobiera parametry do panującej scenerii, a ręczne ustawienie parametrów dla nowicjusza wymagają dużej ilości prób i błędów... przydałoby się też więcej motywów do robienia \"śmiesznych\" zdjęć., , - do minusów  można zaliczyć nieco zbyt wysoką cenę do parametrów, które oferuje telefon., , - może dla niektórych to nie problem, ale dla mnie sporą ujmą jest brak radia (przy zakupie myślałem że jest, gdyż wiele specyfikacji to potwierdzało) gdzie w wielu tańszych modelach ono występuje... niektórzy powiedzą - \"radio internetowe\", ok ale nie wszędzie da się z niego korzystać i przy kiepskim zasięgu/transferze będzie się cięło., , - głośnik nie jest idealny ale daję radę., , - brak IrDA, przydałoby się żeby używać telefonu jako pilota., , - wg mnie minusem jest też logo producenta, zamiast z przodu mógł je umieści z tyłu, dzięki temu można by było zyskać na wielkości wyświetlacza lub nieco zmniejszyć wymiar telefonu.",
            "author": "anonim",
            "useful": 5,
            "useless": 4,
            "purchased": false,
            "opinion_id": 8948155,
            "pros": "dobrze wykończony, elegancki wygląd, przyzwoite zdjęcia",
            "cons": "brak irda, brak radia, nie za bogaty w funkcje aparat, za wysoka cena jak na parametry",
            "review_date": "2019-01-18 01:57:21",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "Bardzo dobry telefon. Oczywiście przedziale ceny 1000 złotych. Polecam jak najbardziej.",
            "author": "E...a",
            "useful": 1,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10606177,
            "pros": "łatwość obsługi",
            "cons": null,
            "review_date": "2019-06-02 12:07:59",
            "purchase_date": "2019-05-02 09:05:26"
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Telefon wykonany po prostu mistrzowsko. Jakość materiałów , spasowanie wszystko premium. Pomimo średniej wydajności podzespołów ( jednak taki A6 ma gorszy procesor ) to android one robi robote i telefon działa super. Zdjecia wychodzą ekstra dzieki optyce zeissa. Telefon wart zakupu w sieciach  gdyż tam oferują go w absolutnie okazyjnych cenach ( ciekawe kiedy sie połapią ,ze robią ludziom prezent za pół darmo )Brać i sie nie zastanawiać.",
            "author": "Piotrek",
            "useful": 12,
            "useless": 5,
            "purchased": false,
            "opinion_id": 8494928,
            "pros": "wygląd",
            "cons": null,
            "review_date": "2018-10-29 11:16:53",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Jakość materiałów i wykonanie na najwyższym poziomie. Nowoczesny procesor SMD 636 (Cortex A73x4). Zdjęcia biją Moto X Play na głowę. Tak donośnego i dobrego jakościowo dzwonka jeszcze nie słyszałem w telefonie. Muzyka na słuchawkach (z Poweramp) - bardzo przyzwoicie. Telefon działa szybko. Bateria trzyma całe 2 dni przy rozsądnym użytkowaniu (internet, YTB). Słabe strony - 3 GB RAM (ale jest dostęona z 4 GB). Obecnie w cenie 1200-1300 pln jest już konkurencyjny. Konkurencja: Nokia 7 plus, Huawei Mate 20 Lite.",
            "author": "Grzegorz",
            "useful": 3,
            "useless": 0,
            "purchased": false,
            "opinion_id": 8672195,
            "pros": "czas pracy na baterii, funkcjonalność, łatwość obsługi, wygląd",
            "cons": null,
            "review_date": "2018-12-04 18:12:07",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "Dobry stosunek jakości do ceny,  optymalny wybór.",
            "author": "Marek",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10616526,
            "pros": null,
            "cons": null,
            "review_date": "2019-06-05 10:12:42",
            "purchase_date": "2019-04-29 15:28:41"
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "Do Androida One trzeba się przyzwyczaić",
            "author": "Użytkownik Ceneo",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 11651167,
            "pros": null,
            "cons": null,
            "review_date": "2020-01-28 11:35:25",
            "purchase_date": "2019-12-30 17:38:28"
        },
        {
            "recommendation": "",
            "stars": "3,5/5",
            "content": "nie mam jeszcze wyrobionego zdania",
            "author": "zbigniew",
            "useful": 0,
            "useless": 2,
            "purchased": true,
            "opinion_id": 10803312,
            "pros": null,
            "cons": null,
            "review_date": "2019-07-18 18:08:16",
            "purchase_date": "2019-07-08 18:55:11"
        },
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Wcześniej używałem Galaxy J5 2016. Koneserem telefonów nie jestem. Jak dla mnie Nokia robi wystarczająco dobre zdjęcia, czas pracy na bateri OK (trzyma podobnie jak Samsung). Jakość wykończenia też w porządku., , Czytnik linii papilarnych tez działa bez zarzutu (przez dwa tygodnie miałem Galaxy S7 i tam dosyć często nie łapał odcisku palca)., , Dla mnie największym minusem tego telefonu jest brak osobnego slotu na kartę pamięci. Jest on współdzielony z drugą kartą pamięci. Ja używam dwie karty, więc nie mogę już rozszerzyć pamięci.",
            "author": "Piotr",
            "useful": 1,
            "useless": 3,
            "purchased": false,
            "opinion_id": 10221205,
            "pros": null,
            "cons": null,
            "review_date": "2019-03-10 20:40:59",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "super",
            "author": "Użytkownik Ceneo",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 11886411,
            "pros": null,
            "cons": null,
            "review_date": "2020-03-11 18:16:41",
            "purchase_date": "2020-03-01 14:16:26"
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "ok",
            "author": "nik",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10699949,
            "pros": null,
            "cons": null,
            "review_date": "2019-06-25 12:53:01",
            "purchase_date": "2019-06-17 10:30:52"
        },
        {
            "recommendation": "",
            "stars": "3/5",
            "content": "Nie jest odporny na zamoczenie, nawet małe. Niestety musiałem go wyrzucić.",
            "author": "Andrzej",
            "useful": 0,
            "useless": 1,
            "purchased": true,
            "opinion_id": 11049482,
            "pros": null,
            "cons": null,
            "review_date": "2019-09-17 08:31:56",
            "purchase_date": "2019-07-25 12:16:01"
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Nokia 7.1 to bardzo dobry średniak. Elegancki z wyglądu i funkcjonalny - ma NFC więc GPay chodzi na pełnych obrotach. Przy słabym oświetleniu robi dobre zdjęcia. Czysty Android/Android One to wielka zaleta - pierwsze uruchomienie i już restart, aktualizacja z 8.0 Oreo do 9.0 Pie.",
            "author": "VolferSSJ",
            "useful": 3,
            "useless": 0,
            "purchased": true,
            "opinion_id": 10439291,
            "pros": "czas pracy na baterii, dobrze wykończony, elegancki wygląd, estetyczny, funkcjonalność, łatwość obsługi, przyzwoite zdjęcia, wygląd, wystarczające osiągi",
            "cons": "śliska obudowa",
            "review_date": "2019-04-24 20:53:52",
            "purchase_date": "2019-04-10 20:11:43"
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Jestem bardzo zadowolony z tego telefonu. Moim zdaniem najlepszy stosunek jakości do ceny, jaki można sobie wyobrazić. Czysty Android sprawia, że telefon działa sprawnie, szybko, bez przycinania. Do tego to jeden z najładniejszych smartfonów na rynku. Dodatkowy walor to aparat. Optyka Zeiss nie jest tu przypadkowa.",
            "author": "Maciej",
            "useful": 0,
            "useless": 0,
            "purchased": false,
            "opinion_id": 10074322,
            "pros": "czas pracy na baterii, dobrze wykończony, elegancki wygląd, estetyczny, łatwość obsługi, przyzwoite zdjęcia",
            "cons": "brak radia, nie za bogaty w funkcje aparat",
            "review_date": "2019-02-10 11:53:06",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "4/5",
            "content": "Estetyka i wykończenie  super , ale do damskiej torebki za ciężki . Nokia wraca do dawnej świetności .",
            "author": "Talisman2018",
            "useful": 5,
            "useless": 0,
            "purchased": true,
            "opinion_id": 8639133,
            "pros": null,
            "cons": null,
            "review_date": "2018-11-29 14:18:24",
            "purchase_date": "2018-11-16 11:02:07"
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Jeszcz do końca go nie rozszyfrowałam, ale na razie spełnia moje oczekiwania. Nokia zawsze była moją ulubioną marką i cieszę się, że się nie zawiodłam.",
            "author": "e kadler",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 12066451,
            "pros": null,
            "cons": null,
            "review_date": "2020-04-04 11:35:47",
            "purchase_date": "2020-03-09 12:38:19"
        },
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Za mało czasu na opinie ale telefon wyglada bardzo elegancko porzadnie",
            "author": "lechu",
            "useful": 3,
            "useless": 0,
            "purchased": true,
            "opinion_id": 8820970,
            "pros": null,
            "cons": "czas pracy na baterii",
            "review_date": "2018-12-28 11:52:02",
            "purchase_date": "2018-12-17 00:04:26"
        },
        {
            "recommendation": "Nie polecam",
            "stars": "0,5/5",
            "content": "Telefon może jest ładny, w miarę funkcjonalny i kiedy działał nie miałem zastrzeżeń , ale po 2 miesiącach podczas normalnego użytkowania zawiesił się i \"utknął\" w trybie DOWNLOAD MODE. Wszelkie próby restartu spełzły na niczym, jestem zmuszony oddać go do serwisu co wiąże się z utratą danych (nie miałem karty microsd, bo korzystam z 2 kart SIM) i brakiem telefonu na około 2 tygodnie. Straciłem zaufanie do tego telefonu, ciekawe jakie jest prawdopodobieństwo,że sytuacja się powtórzy. Dla mnie to dyskwalifikacja tego modelu.",
            "author": "domins",
            "useful": 0,
            "useless": 2,
            "purchased": false,
            "opinion_id": 10782301,
            "pros": null,
            "cons": null,
            "review_date": "2019-07-13 17:55:53",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Fajny, zgrabny telefon. Często aktualizowany i szybki. Jakość dźwięku na plus, aparat na minus. Do codziennej pracy jak znalazł. Bateria bez cudów.",
            "author": "Ostap",
            "useful": 0,
            "useless": 0,
            "purchased": false,
            "opinion_id": 10789514,
            "pros": "wygląd",
            "cons": null,
            "review_date": "2019-07-16 08:46:45",
            "purchase_date": null
        },
        {
            "recommendation": "Polecam",
            "stars": "4,5/5",
            "content": "Jest OK",
            "author": "irytacja",
            "useful": 0,
            "useless": 0,
            "purchased": true,
            "opinion_id": 11353989,
            "pros": "dobrze wykończony, funkcjonalność, łatwość obsługi, wygląd",
            "cons": "czas pracy na baterii",
            "review_date": "2019-12-02 14:21:24",
            "purchase_date": "2019-11-12 20:00:03"
        },
        {
            "recommendation": "Polecam",
            "stars": "5/5",
            "content": "Super telefon. Bateria może utrzymać nawet 3 dni. W obsłudzę jest łatwy. Zachwicił mnie wygląd tego telefonu oraz wiele innych rzeczy. Bardzo polecam.",
            "author": "Victoria",
            "useful": 0,
            "useless": 0,
            "purchased": false,
            "opinion_id": 10387266,
            "pros": "czas pracy na baterii, funkcjonalność, łatwość obsługi, wygląd",
            "cons": null,
            "review_date": "2019-04-12 10:25:10",
            "purchase_date": null
        },
        {
            "recommendation": "Nie polecam",
            "stars": "2,5/5",
            "content": "Telefon generalnie ok ale ma minusy. Nie można kożystać z dwóch kart sim i karty pamięci jednocześnie. Gdybym to wiedział przed zakupem,  pewnie mój wybór padłby na inny telefon. Drugi minus brak możliwości instalowania aplikacji na karcie pamięci. Jeśli komuś to nie przeszkadza to polecam telefon.",
            "author": "Marek",
            "useful": 1,
            "useless": 3,
            "purchased": false,
            "opinion_id": 10300091,
            "pros": null,
            "cons": null,
            "review_date": "2019-03-26 10:21:17",
            "purchase_date": null
        }
    ]
}